#
#
# #int表示纯数字
# #str表示字符串
# #print()函数打印变量
# #type()显示变量类型
# a=12345678
# print(type(a))
# a="hkasd"
# print(type(a))
# #list代表一个列表，
# #键值对数据 姓名：田高远 ，性别 手机号 13298192802
# e={"姓名":"田高远","性别":"男","手机号":"13298192802"}
# print(type(e))
# print(e)
# #练习
# # 第一组数据   张三,李四,王五,赵六,钱七
# # 第二组数据    姓名 张三  年龄 18 性别 女  科目 语文 成绩 80
# # 第三组数据   A，2,3,4,5,6,7,8,9，J,Q,K
# # 第四组数据  10000
# # 第五组数据  学生
# q=("张三","李四","王五","赵六","钱七")
# print(q)
# print(type(q))
# w={"姓名":"张三","年龄":"18","性别":"女","科目":"语文","成绩":"80",}
# print(type(w))
# print(w)
# e=("A",2,3,4,5,6,7,8,9,"J","Q","K",)
# print(e)
# print(type(e))
# r=10000
# print(r)
# print(type(r))
# t="学生"
# print(t)
# print(type(t))
# #小明有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱   求出小明可以买那种烟
# a=20
# if(a>10):
#     print(a,"元能买红双喜")
# if(a>5):
#     print(a,"元能买大前门")
# if(a>=25):
#     print(a,"元不能买玉溪")
# #     成人票 200 12岁以下的小孩票100 60岁以上的老人票 150 小明今年18岁，去买票应该买那种票？
# a=18
# if(a>=60):
#     print(a,"岁要买老人票 150元")
# elif(a>=18):
#     print(a,"岁要买成年人 200元")
# else:
#     print(a,"岁不能买小孩票 100元")
#
# for i in range(100):
#     if(i % 2)==1:
#         print(i)
# # 九九乘法
# for c  in range(1,10):
#     for k  in range(1,c+1):
#         print(k,"x",c,"=",c*k,"\t",end="")
#     print()
#
# #成绩0-59不及格，60-70及格，70-80良好 80以上为优秀  [90,100,81,84]判断下改组成绩是否全部都是优秀
# z=0 #0代表全部优秀，1代表不全部为优秀。
# for i in [90,100,81,84]:
#     if(i)<80:
#         z=1
# if(z==0):
#     print("全部优秀")
# else:
#     print("不全是优秀")

#"01010010001110001001001010101010010101" 计算下几个0 几个1
# a=0
# b=0
# c="01010010001110001001001010101010010101"
# for i in c :
#     if(i)=="0":
#         a=a+1
#     else:
#         b=b+1
# print("有",a,"个","0","有",b,"个","1");
#求1+2+3+4...+100
# a=0
# for i in range(1,101):
#     a=a+i
#     i=i+1
# print(a)
a=0
i=1
while(i<101):
    a=a+i
    i=i+1
print(a)
#求10以内相乘
































